Revit 2027 API
RebarShapeDefinition.CheckDefaultParameterValues Method
 Check that the shape can be solved with the default parameter values.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CheckDefaultParameterValues(
	double bendRadius,
	double barDiameter
)
Public Function CheckDefaultParameterValues (
	bendRadius As Double,
	barDiameter As Double
) As Boolean
public:
bool CheckDefaultParameterValues(
	double bendRadius,
	double barDiameter
)
member CheckDefaultParameterValues :
        bendRadius : float *
        barDiameter : float -> bool
Parameters
bendRadius Double
 A value for the Bend Radius parameter. Zero is allowed.
barDiameter Double
 A value for the Bar Diameter parameter. Zero is allowed.
Return Value
Boolean
 True if the rebar can be solved with the default parameter values and the given bend radius and bar diameter; false if it cannot.
Remarks
 This function runs the rebar solver with the default parameter values. If it fails (returns false), rebar instances of this shape will not work. This may be from the default parameters being inconsistent, or from some error in the shape definition. The solver requires a specific bend radius and bar diameter, and the result depends on these values, but in practice they usually do not affect the result of this function as long as they are small. It is legal to pass 0.0 for both arguments. The definition must be Complete in order for this function to succeed.
See Also
Reference
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace